In [2]:
%load_ext sql
import pandas as pd
import psycopg2
import sqlalchemy
import matplotlib.pyplot as plt
from sqlalchemy import create_engine
from config import pw

In [21]:
engine = create_engine(f'postgresql://postgres:{pw}@localhost/employee_db')

In [19]:
%sql postgresql://postgres:{pw}@localhost/employee_db

In [20]:
%%sql

SELECT * FROM employees LIMIT 3

 * postgresql://postgres:***@localhost/employee_db
3 rows affected.

[(473302, 's0001', datetime.date(1953, 7, 25), 'Hideyuki', 'Zallocco', 'M', datetime.date(1990, 4, 28)),
 (475053, 'e0002', datetime.date(1954, 11, 18), 'Byong', 'Delgrande', 'F', datetime.date(1991, 9, 7)),
 (57444, 'e0002', datetime.date(1958, 1, 30), 'Berry', 'Babb', 'F', datetime.date(1992, 3, 21))]

In [22]:
pd.read_sql_query('SELECT * FROM employees', engine)

        emp_no emp_title  birth_date   first_name  last_name sex   hire_date
0       473302     s0001  1953-07-25     Hideyuki   Zallocco   M  1990-04-28
1       475053     e0002  1954-11-18        Byong  Delgrande   F  1991-09-07
2        57444     e0002  1958-01-30        Berry       Babb   F  1992-03-21
3       421786     s0001  1957-09-28        Xiong   Verhoeff   M  1987-11-26
4       282238     e0003  1952-10-28   Abdelkader    Baumann   F  1991-01-18
...        ...       ...         ...          ...        ...  ..         ...
300019  464231     s0001  1958-08-14  Constantino    Eastman   M  1988-10-28
300020  255832     e0002  1955-05-08       Yuping     Dayang   F  1995-02-26
300021   76671     s0001  1959-06-09       Ortrud   Plessier   M  1988-02-24
300022  264920     s0001  1959-09-22        Percy   Samarati   F  1994-09-08
300023  464503     s0002  1964-05-31       Arvind  Slobodova   M  1987-11-23

[300024 rows x 7 columns]